//KC03J21E JOB CLASS=A,MSGCLASS=O,MSGLEVEL=(1,1),NOTIFY=&SYSUID,        00010000
//             TIME=(,5)    ,RESTART=STEP2                              00011000
//JOBLIB   DD DSN=KC03J21.CURSOS.PGMLIB,DISP=SHR
//STEP0001 EXEC PGM=PGMESES2
//*
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSIN    DD SYSOUT=*
12021999
